<?php
// По зададено число n, да се изведе на екрана таблица по
// следния начин:
// Пример:
// 				Въведете n:
// 				2
// 				11
// 				33
// 				Въведете n:
// 				1
// 				0
// 				Въведете n:
// 				4
// 				3333
// 				5555
// 				7777
// 				9999
// 				Въведете n:
// 				3
// 				222
// 				444
// 				666
require_once 'readline.php';
$n = readline("n = " );

$coef = $n - 1;

for ($i = 0; $i < $n; $i++) {
	
	$result = "";
	
	for ($j = 0; $j < $n; $j++) {
		$result .= $coef;
	}
	$coef += 2;
	
	
	echo "$result" . PHP_EOL;
}







