<?php
require_once 'readline.php';


// Задача 13: Да се състави програма, която извежда всички
// естествени трицифрени числа, които имат сбор на цифрите равен
// на дадено число.
// Дадено : sum, където 2>=sum<=27.
// Пример: 26
// Изход: 899, 989, 998.

$sum = readline('numb: ');

if ($sum < 2 || $sum > 27) {
	echo 'invalid input';
	return ;
}

for ($i = 100; $i <= 999; $i++) {

	$x = $i / 100;
	$x = (int)$x;

	$y = $i / 10;
	$y = (int)$y;
	$y %= 10;

	$z = $i % 10;

	if ($x + $y + $z == $sum) {
		echo "$x $y $z " . PHP_EOL;
	}

}


