<?php
require_once 'readline.php';

// Задача 16:
// Да се състави програма, чрез която се въвеждат 2 естествени
// числа N, M от интервала [10..5555].
// Програмата, чрез цикъл for, да извежда всички числа от
// интервала, които са кратни на 50 в низходящ ред.
// Пример: 25,249
// Изход: 200,150,100, 50.


$n = readline('N = ');
$m = readline('M = ');

$max = max($n , $m);

$min = min($n , $m);

$result = '';

do{
	

	if ($max % 50 == 0) {
		$result .= "$max ";
	}	
	
$max--;	
	
	
}while ($max != $min);

echo $result;

