<?php
// Задача 3:
// Да се състави програма, която проверява дали: предварително
// въведен масив от естествени числа е сортиран във възходящ ред.
// Програмата да извежда съобщения и в двата случая.
// Пример:
// 1 3 5 7 9 11 10
// Изход:
// 11 > 10
// Елементите на масива не са сортирани.



$arr = [1,3,5,7,9,11,10];


function isSortArray($arr) {
	
	$len = count($arr);
	
	for ($i = 0; $i < $len - 1; $i++) {
		if ($arr[$i] > $arr[$i - 1]) {
			$j = $i + 1;
			echo " $arr[$i] > $arr[$j] " . PHP_EOL ;
			echo 'Елементите на масива не са сортирани.';
			return ;
		}
	}
	
	echo 'Елементите на масива са сортирани.';
	
}

isSortArray($arr);



