<?php
// Задача 2:
// Ще наричаме площадка непрекъсната последователност от елементи с
// равни стойности.
// Да се състави програма, която проверява коя е най-дългата площадка
// в предварително въведен масив от естествени числа.
// Програмата да извежда началния вид на масива и най-дългата
// площадка в него.
// Пример:
// 1 3 3 7 9 9 9 9 11 11 12 14
// Изход:
// Най-дългата площадка е: 4 елемента
// Брой на площадките: 3

$arr = [5,5,5,1,1,1,8,8,8,8,8,8,8,4,4,4,4,1,3,3,2,2];


function fn($arr) {
	
	$count = 0;
	$maxCount = 1;
	$numb;
	$len = count($arr);
	$set = 0;
	for ($i = 0; $i < $len - 1; $i++) {
		
		$count++;
		
		if ($arr[$i] != $arr[$i + 1]) {
			
			if ($count > 1) {
				$set++;
			}
			
			if ($count > $maxCount) {
				$maxCount = $count;
				$numb = $arr[$i];

			}
			$count = 0;
		}
		
	}
	echo "Най-дългата площадка е: $maxCount елемента" , PHP_EOL;
	
	echo "Брой на площадките: $set", PHP_EOL;
	
}


fn($arr);




