<?php
require_once 'readline.php';
// Да се състави програма, която получва от конзола 2 естествени
// двуцифрени числа a,b.
// Програмата да изведе съобщение дали последната цифра от
// произведението на двете числа е четна, както и самата цифра.
// Входни данни: a,b - естествени числа от интервала [10..99].
// Пример: 15, 25
// Изход: 375, 5 нечетна


$a = readline('a = ');
$b = readline('b = ') . PHP_EOL;

$c = $a * $b;
$d = $c % 10;

if (!($c % 2)) {
	echo "$c , $d even";
}
else {
	echo "$c , $d odd";
}