<?php
require_once 'readline.php';
// Въведено е трицифрено естествено число от вида abc.
// Трябва да се провери дали:
// ако a = b = c - Изход: цифрите са равни;
// ако a>b>c - Изход: цифрите са във възходящ ред;
// ако a<b<c цифрите са в низходящ ред;
// и изход: цифрите са ненаредени, за неописаните случаи.
// Да се състави програма, която извежда резултата от проверката за
// наредба на цифрите в числото.
// Пример: 345
// Изход: възходящ ред.



$numb = 345;

$c = $numb % 10;

$numb = (int)$numb / 10;

$b = $numb % 10;

$numb = (int)$numb / 10;

$a = $numb % 10;


if ($a < $b && $b < $c) {
	echo '  цифрите са в низходящ ред';
}elseif ($a > $b && $b > $c) {
	echo ' цифрите са във възходящ ред';
}elseif ($a == $b && $b == $c){
	echo 'цифрите са равни';
}else {
	echo 'цифрите са ненаредени, за неописаните случаи.';
}


