<?php
// Напишете програма, която първо чете масив и после създава нов
// масив със същия размер по следния начин: стойността на всеки
// елемент от втория масив да е равна на сбора от предходния и
// следващият елемент на съответния елемент от първия масив.
// Да се изведе получения масив.
require_once 'readline.php';

$len = readline('enter lenght: ');


$arr = [];

for ($i = 0; $i < $len; $i++) {
	$arr[$i] = readline("element [$i] = ");
}

$arr2 = [];


$arr2[0] = $arr[1];

if ($len > 2) {
	for ($i = 1; $i < $len - 1; $i++) {
	
		if ($arr[$i - 1] && $arr[$i + 1]) {                  
			$arr2[$i] = $arr[$i - 1] + $arr[$i + 1];
			continue;
		}
	
	}
	
}

$arr2[$len -1] = $arr[$len - 2];


print_r($arr2);