<?php
// Задача 9:
// Напишете програма, в която потребителя въвежда масив, след което
// елементите на масива се обръщат в обратен ред (Целта не е масива да
// 		се отпечата в обратен ред, ами първо да се обърне, след което да се
// 		отпечата в нормален ред). Пробвайте да решите задачата първо с един
// 		допълнителен масив и после без да използвате друг масив.
require_once 'readline.php';

$arr = [];

for ($i = 0; $i < 5; $i++) {
	$arr[$i] = readline('enter number:');
}


$arr_1 = [];

$len = count($arr);


for ($i = $len - 1; $i >= 0; $i--) {
	
	$arr_1[$i] = $arr[$i];
	
}

print_r($arr_1);


$n = 0;

$count = 1;

$halfLen = ($len / 2);


for ($i = 0; $i < $halfLen; $i++) {
	
	$n = $arr[$i];
	
	$arr[$i] = $arr[$len - $count];
	

	$arr[$len - $count] = $n;
	
	$count++;
}


print_r($arr);










