<?php
// Задача 10:
// Да се състави програма, чрез която се въвеждат 7 цели числа в
// едномерен масив.
// Програмата да изведе числото, което е най-близко до средната
// стойност на въведените числа.
// Пример: 1,2,3,4,5,6,7
// Изход: средна стойност 4, най-близка стойност 4
require_once 'readline.php';

$arr = [];

for ($i = 0; $i < 7; $i++) {
	$arr[$i] = readline('enter number: ');
}



$len = count($arr);
$sum = 0;

for ($i = 0; $i < $len; $i++) {
	
	$sum += $arr[$i];
	
}

$result = $sum / $len;


echo $result;
