<?php
// Задача 11:
// Да се състави програма, която въвежда от клавиатурата 7 цели числа
// в едномерен масив
// Програмата да изведе всички числа кратни на 5, но по големи от 5.
// Пример: -23, -55, 17, 75, 56, 105, 134
// Изход: 75,105 2 числа
require_once 'readline.php';


$arr = [ -23, -55, 17, 75, 56, 105, 134];

$result = '';

$len = count($arr);

$count = 0;

for ($i = 0; $i < $len; $i++) {
	
	if ($arr[$i] % 5 == 0 && $arr[$i] > 5) {
		$count++;
		$result .= "$arr[$i] ";
		
	}
	
}

echo $result. '    ' . $count;


