<?php
// Задача 14:
// Имате предварително въведен едномерен масив, съдържащ реални
// числа.
// Да се състави програма, чрез която се избират само елементи със
// стойности от интервала [-2.99..2.99] и новата редица се извежда на
// екрана.
// Пример: 7.1,8.5,0.2,3.7,0.99,1.4,-3.5,-110,212,341,1.2
// Изход: 0.2; 0.99; 1.4; 1.2


$arr = [ 7.1,8.5,0.2,3.7,0.99,1.4,-3.5,-110,212,341,1.2];


$len = count($arr);

$result = '';

$flag = true;

for ($i = 0; $i < $len; $i++) {
	
	if ($flag && $arr[$i] > -2.99 && $arr[$i] < 2.99) {
		$result .= $arr[$i] ;
		$flag = false;
	
	}
	
	if($arr[$i] > -2.99 && $arr[$i] < 2.99){
		$result .= '; ' . $arr[$i];
	}
	
}
echo $result;