<?php
// Да се състави програма, чрез която предварително въведени 10
// реални числа от интервала се обработват по следния начин:
// 1. Извежда съществуващите числа.
// 2. Всички елементи със стойност по-малки от -0.231 се заменят със
// сумата от квадрата на индекса им + числото 41.25, а всички останали
// елементи се заменят с произведението между самия елемент и
// неговият пореден номер
// 3. Да се изведат елементите от началния и новообразувания масив.
// 4. Да се изведат средната стойност на всички елементи от новата
// редица, които са различни от 0.
// Пример: -1.12, -2.43, 3.1, 4.2, 0, 6.4, - 7.5, 8.6, 9.1, -4
// Изход: 42.25, 45.25, 9.3, 16.8, 0, 38.4, 90.25, 68.8, 81.9,141.25

$arr = [-1.12, -2.43, 3.1, 4.2, 0, 6.4, - 7.5, 8.6, 9.1, -4];

$len = count($arr);

$average = 0;
$count = 0;
$sum = 0;

$array_1 = '';
$array_2 = '';

for ($i = 0; $i < $len; $i++) {

	$n = $arr[$i];
	
	if ($arr[$i] < -0.231) {
	
		
		$n = pow($i + 1, 2) + 41.25;
		
		$array_1 .= $arr[$i] . ' ';
		$array_2 .= pow($i + 1, 2) + 41.25 . ' ';
		
		 
	}else {
		
		$n = ($i + 1) * $n;
		
		$array_1 .= $arr[$i] . ' ';
		$array_2 .= ($i + 1) * $arr[$i] . ' ';
	
		
	}
	if ($n) {
		
		$count++;
		$sum += $n;
		
	}
}
$average = $sum / $count;

echo $array_1 . PHP_EOL;
echo $array_2 . PHP_EOL;
echo "average = $average";
