<?php
// Задача 17:
// Една редица от естествени числа ще наричаме зигзагообразна нагоре,
// ако за елементите и са изпълняват условията:
// N1 < N2 > N3 < N4 > N5 <..
// Съставете програма, която проверява дали въведени в едномерен
// масив редица от числа изпълняват горните изисквания.
// Пример: 1 3 2 4 3 7
// Изход: изпълнява изискванията за зигзагообразна нагоре редица



$arr = [1, 3, 2, 4, 3, 7];


$len = count($arr);

for ($i = 1; $i < $len - 1; $i++) {
	if ($i % 2 != 0) {
		if ($arr[$i - 1] < $arr[$i] && $arr[$i] > $arr[$i + 1]) {
		
		}else{
			echo ' false';
			return ;
		}
	}else {
		if ($arr[$i - 1] > $arr[$i] && $arr[$i] < $arr[$i + 1]) {
		
		}else{
			echo ' false';
			return ;
		}
	}
	
	
}

echo 'изпълнява изискванията за зигзагообразна нагоре редица';
