<?php
// Задача 18:
// Дадени са два едномерни масива с естествени числа.
// Да се състави програма, която сравнява всички числа с еднакви
// индекси от двата масива и записва в трети масив, по-голямото от
// двете числа.
// Да се изведе съдържанието и на трите масива
// Пример:
// 18,19,32,1,3, 4, 5, 6, 7, 8
// 1, 2, 3,4,5,16,17,18,27,11
// Изход:
// 18,19,32 ,4,5,16,17,18,27,11


$arr_01 = [18,19,32,1,3, 4, 5, 6, 7, 8];
$arr_02 = [1, 2, 3,4,5,16,17,18,27,11];

$result = [];


$len = count($arr_01);

for ($i = 0; $i < $len; $i++) {
	
	$result[$i] = max($arr_01[$i], $arr_02[$i]);
	
}


echo implode(', ', $arr_01) . PHP_EOL;
echo implode(', ', $arr_02) . PHP_EOL;


echo implode(', ', $result);