<?php
// Задача 3:
// Да се състави програма, чрез която се въвеждат последователно две
// редици от символи без интервали.
// Програмата да извежда съобщение за резултата от сравнението им по
// позиции.
// Пример: хипопотам, хипопотук
// Изход:
// Двата низа са с равна дължина.
// Разлика по позиции:
// 8 а-у
// 9 м-к
require_once 'readline.php';

$str1 = readline('str1: ');
$str2 = readline('str2: ');


$len1 = mb_strlen($str1, 'UTF-8');
$len2 = mb_strlen($str2, 'UTF-8');

$flag = $len1 == $len2 ? 1 : 0;
$flagText = 0;
if ($flag) {
	echo 'Двата низа са с равна дължина.' ,PHP_EOL;
	for ($i = 0; $i < $len1; $i++) {
		
		if ($str1[$i] != $str2[$i] && !$flagText) {
			$flagText = 1;
			echo 'Разлика по позиции:' , PHP_EOL;
		}
		if ($str1[$i] != $str2[$i]) {
			echo "$i  $str1[$i]-$str2[$i]" , PHP_EOL;
		}
	};
}else {
	echo 'Двата низа са с различна дължина.';
}

