<?php
// Задача 5:
// Да се състави програма, чрез която се въвеждат 2 редици от знаци
// (думи).
// Ако в двете редици участва един и същи знак, да се изведе на екрана
// първата редица хоризонтално, а втората вертикално, така че да се
// пресичат в общия си знак.
// Ако редиците нямат общ знак да се изведе само уведомително
// съобщение.
// Пример :
// м
// а
// шапка
// и
// н
// а
require_once 'readline.php';


$str_1 = readline('str 1: ');

$str_2 = readline('str 2: ');

$len = mb_strlen($str_1, 'UTF-8');

$flag = 0;

for ($i = 0; $i < $len; $i++) {
	
	
	if ($str_1[$i] == $str_2[0]) {
		echo $str_2 , PHP_EOL;
		continue;
	}
	echo $str_1[$i] , PHP_EOL;
	
	
}