<?php
// Задача 8:
// Да се състави програма, чрез която се въвежда ред от символи
// (стринг, низ).
// Програмата да изведе на екрана дали въведения стринг е палиндром,
// т.е. дали четен отляво-надясно и отдясно-наляво е един и същ.
// Вход: капак
// Изход: да.
// Вход: тенджера
// Изход: не.
require_once 'readline.php';


$str = readline('enter palindrom: ');

$len = mb_strlen($str, 'UTF-8');
$halfLen = (int)($len / 2);

$j = $len - 1;

for ($i = 0; $i < $halfLen; $i++) {
	
	if ($str[$i] != $str[$j]) {
		echo 'Изход: не.';
		return ;
	}
	$j--;
}

echo 'Изход: да.';