<?php
// Задача 13:
// Да се създаде метод, който приема два масива от числа и връща
// масив, съдържащ всички елементи на подадените масиви, като в
// първата част на масива са елементите на първия подаден масив,
// а във втората част – тези на втория подаден масив.


$arr1 = [11,12,13,14];

$arr2 = [15,16,16,18];


function oneArray($arr1, $arr2) {
	$result = [];
	
	$len1 = count($arr1);
	$len2 = count($arr2);
	
	
	for ($i = 0; $i < $len1; $i++) {
		array_push($result, $arr1[$i]);
	}
	
	for ($i = 0; $i < $len2; $i++) {
		array_push($result, $arr2[$i]);
	}
	
	return $result;
}



print_r(oneArray($arr1, $arr2));